{ "quotes" : [
{"quote":"I am thinking about something much more important than bombs, I am thinking about computers.","attribution":"John von Neumann"},
{"quote":"We are what we repeatedly do. Excellence, then, is not an act, but a habit.","attribution":"Aristotle"},
{"quote":"-there will never be a time in your life when you say, 'I wish I'd spent less time with people I love, and more time shopping.'","attribution":"Wil Wheaton"},
{"quote":"The trouble is, if you don't risk anything, you risk even more.","attribution":"Erica Jong"},
{"quote":"We are all teachers. Whether we know it, or not. Whether we take responsibility for it, or not.","attribution":"Maya Angelou"},
{"quote":"The single biggest problem in communication is the illusion that it has taken place.","attribution":"George Bernard Shaw"},
{"quote":"Think of the computer not as a tool but as a medium.","attribution":"Brenda Laurel"},
{"quote":"Identify the core human need, without reference to whether it is going to be served with bits, boom boxes or bowling balls.","attribution":"J. H. Murray"},
{"quote":"We are, in sum, incomplete or unfinished animals who complete or finish ourselves through culture.","attribution":"Clifford Geertz"},
{"quote":"Hide not your talents, they for use were made. What's a sun-dial in the shade.","attribution":"Benjamin Franklin"},
{"quote":"If you learn from defeat, you haven't really lost.","attribution":"Zig Ziglar"},
{"quote":"Share the knowledge for free, sell the heavy atoms.","attribution":"Jay Rogers"},
{"quote":"If the creative artist worries if he will still be free tomorrow, then he will not be free today.","attribution":"Salman Rushdie"},
{"quote":"There's what life gives you and what you do with it. Those are the only two forces that make you what you are. Deal with it. Embrace it.","attribution":"Largo, The Heir Apparent: Largo Winch (2008)"},
{"quote":"A writer is a person for whom writing is more difficult than it is for other people.","attribution":"Thomas Mann"},
{"quote":"I did not have time to write you a short letter, so I wrote you a long one instead.","attribution":"Mark Twain"},
{"quote":"The greatest enemy will hide in the last place you would ever look.","attribution":"Julious Caesar 75bc"},
{"quote":"The only way to get smarter is by playing a smarter opponent.","attribution":"Fundamentals of Chess, 1883"},
{"quote":"If you're the smartest man in the room, you're in the wrong room.","attribution":"Richard Tirendi"},
{"quote":"Create your future from your future, not the past.","attribution":"Werner Erhard"},
{"quote":"I am certain of nothing but the holiness of the heart's affections, and the truth of imagination.","attribution":"John Keats"},
{"quote":"An entrepreneur is a self-employed person working 16 hours a day to avoid working 8 hours a day for someone else.","attribution":"Anonymous"},
{"quote":"Live as though you were in the early days of a better nation.","attribution":"Cory Doctorow in the dedication to For the Win"},
{"quote":"May you live in interesting times.","attribution":"Ancient Chinese Curse"},
{"quote":"He loves to hear himself type.","attribution":"Gavin L. Vincent"},
{"quote":"The tragedy of life is what dies inside a man while he lives.","attribution":"Albert Schweitzer"},
{"quote":"We cannot solve our problems with the same thinking we used to create them.","attribution":"Albert Einstein"},
{"quote":"I believe if you want to live in a better world, you have to get off your ass and make it better.","attribution":"Jacque Fresco"},
{"quote":"If you don't like change you are going to like irrelevance even less.","attribution":"Gen. Eric Shinseski"},
{"quote":"Never believe in a meritocracy in which no one is funny-looking.","attribution":"Teresa Nielsen Hayden"},
{"quote":"To be a poet is a condition, not a profession.","attribution":"Robert Frost"},
{"quote":"You say: It's ad-funded. I hear: I've settled for making something no one is willing to pay for.","attribution":"Chris Ashworth"},
{"quote":"Men plan, God laughs.","attribution":"Yiddish Proverb"},
{"quote":"The toll of making change is that you will be changed.","attribution":"Seth Godin"},
{"quote":"About the time we think we can make ends meet, somebody moves the ends.","attribution":"Herbert Hoover"},
{"quote":"I like nonsense, it wakes up the brain cells.","attribution":"Dr Seuss"},
{"quote":"There are two ways to sleep well at night... be ignorant or be prepared.","attribution":"Simon Black"},
{"quote":"Without requirements or design, programming is the art of adding bugs to an empty text file.","attribution":"Louis Srygley"},
{"quote":"And now for something completely gratuitous.","attribution":"Grant Imahara"},
{"quote":"When everyone has a laptop [device] and connection to the world, then everyone owns a factory.","attribution":"Seth Godin"},
{"quote":"Never grow a wishbone where your backbone ought to be.","attribution":"Dorothy Parker"},
{"quote":"Do not go where the path may lead; go instead where there is no path and leave a trail.","attribution":"Ralph Waldo Emerson"},
{"quote":"Become a student of change. It is the only thing that will remain constant.","attribution":"Anthony J. D'Angelo"},
{"quote":"Sometimes I've believed as many as six impossible things before breakfast.","attribution":"Lewis Carroll"},
{"quote":"Make no mistake about why these babies are here - they are here to replace us.","attribution":"Jerry Seinfeld"},
{"quote":"Success usually comes to those who are too busy to be looking for it.","attribution":"Henry David Thoreau"},
{"quote":"Arguing with an engineer is like wrestling with a pig in mud. After a while, you realise the pig is enjoying it.","attribution":"Jamie Lawrence"},
{"quote":"Those who don't build must burn.","attribution":"Ray Bradbury in Fahrenheit 451"},
{"quote":"It takes just a brief, creative instant to visualize something great that will take seven years of hard work to make real.","attribution":"Alan Cooper"},
{"quote":"Why fit in when you were born to stand out?","attribution":"Dr. Seuss"},
{"quote":"The secret to winning is constant, consistent management.","attribution":"Tom Landry"},
{"quote":"Not enough gets said about the importance of abandoning crap.","attribution":"Ira Glass"},
{"quote":"Prejudices are what fools use for reason.","attribution":"Voltaire"},
{"quote":"Another flaw in the human character is that everybody wants to build and nobody wants to do maintenance.","attribution":"Kurt Vonnegut"},
{"quote":"The best way to predict the future is to implement it.","attribution":"Alan Kay"},
{"quote":"Institutions will try to preserve the problem to which they are the solution.","attribution":"Clay Shirky"},
{"quote":"In a world of locked doors, the man with the key is king.","attribution":"Jim Moriarty in The Reichenbach Fall, Sherlock, Season 2, Episode 3"},
{"quote":"Don't be a show-off. Never be too proud to turn back. There are old pilots and bold pilots, but no old, bold pilots.","attribution":"US Airmail Pilot E. Hamilton Lee"},
{"quote":"It is by will alone I set my mind in motion.","attribution":"The Mentat Mantra, recited by Piter De Vries, Dune (1984)"},
{"quote":"Wandering the hallway is some of the cheapest error correction out there.","attribution":"Michael Lopp (Rands In Repose)"},
{"quote":"You can't trust code that you did not totally create yourself.","attribution":"Ken Thompson (c.1984)"},
{"quote":"The greatest mistake you can make in life is to be continually fearing you will make one.","attribution":"Elbert Hubbard"},
{"quote":"Our Age of Anxiety is, in great part, the result of trying to do today's job with yesterday's tools - with yesterday's concepts.","attribution":"Marshall McLuhan"},
{"quote":"When you give people too much information, they instantly resort to pattern recognition to structure the experience.","attribution":"Marshall McLuhan"},
{"quote":"Life is karaoke - a never-ending attempt to maintain dignity while a jumble of data uncontrollably blips across a screen.","attribution":"Doug Coupland"},
{"quote":"Confusion is a word we have invented for an order which is not understood.","attribution":"Henry Miller"},
{"quote":"In expanding the field of knowledge we but increase the horizon of ignorance.","attribution":"Henry Miller"},
{"quote":"To see what is in front of one's nose needs a constant struggle.","attribution":"George Orwell"},
{"quote":"The more structure you put into content, the freer it will become.","attribution":"Karen McGrane"},
{"quote":"If you want to tell people the truth, make them laugh, otherwise they'll kill you.","attribution":"Oscar Wilde"},
{"quote":"The web allows us to express ourselves without judging, and in return it remembers everything we said without remorse.","attribution":"Eric A. Meyer"},
{"quote":"A little nonsense now and then is relished by the wisest men.","attribution":"Roald Dahl"},
{"quote":"We feel free when we escape - even if it be but from the frying pan into the fire.","attribution":"Eric Hoffer"},
{"quote":"Men will always be making mistakes as long as they are striving after something.","attribution":"Max Planck"},
{"quote":"You can't use up creativity. The more you use, the more you have.","attribution":"Dr. Maya Angelou"},
{"quote":"Law is just code written in a very free form, error prone, imprecise language. It's basically PHP really.","attribution":"Alex Gaynor"},
{"quote":"Pain is temporary, suck is forever.","attribution":"Michael B Johnson, Pixar"},
{"quote":"A surprise is chaos with intent.","attribution":"Michael Lopp (Rands In Repose)"},
{"quote":"The most daring thing to do with your life is to create stable communities in which the terrible disease of loneliness can be cured.","attribution":"Kurt Vonnegut"},
{"quote":"Failure means you're learning. At scale.","attribution":"Michael Lopp (Rands In Repose)"},
{"quote":"A professional writer is an amateur who didn't quit.","attribution":"Richard Bach"},
{"quote":"If we have data, let's look at data. If all we have are opinions, let's go with mine.","attribution":"Jim Barksdale"},
{"quote":"You can't just wish the future into being. It has to be paid for.","attribution":"Tony Stark as written by Warren Ellis, Iron Man Extremis"},
{"quote":"Copy, extend, and finally, discovery of a new form. It takes a while to shelf old paradigms.","attribution":"Scott Jensen"},
{"quote":"I love the man who can smile in trouble, gather strength from distress and grow brave by reflection.","attribution":"Thomas Paine"},
{"quote":"Fashion is a form of ugliness so intolerable that we have to alter it every six months.","attribution":"Oscar Wilde"},
{"quote":"If there isn't a little art in what you do, the kids will wander off to buy someone else's sneakers.","attribution":"Rich Gold"},
{"quote":"If you want to test a man's character, give him power.","attribution":"Abraham Lincoln"},
{"quote":"Intelligence is like an underwear. It is important that you have it, but not necessary that you show it off.","attribution":"Morgan Freeman"},
{"quote":"The best minds of my generation are thinking about how to make people click ads. That sucks.","attribution":"Jeff Hammerbacher, fmr. Manager of Facebook Data Team"},
{"quote":"Clarity is the counterbalance of profound thoughts.","attribution":"Luc de Clapiers"},
{"quote":"We're close to gone out here. We get a job, we got to make good.","attribution":"Malcolm 'Mal' Reynolds as written by Joss Whedon, Serenity"},
{"quote":"Do you really have five years of experience or one year repeated five times?","attribution":"Kathy Sierra"},
{"quote":"Every great idea starts as a movement, becomes a business and turns into a scam.","attribution":"Unknown"},
{"quote":"Today's landscape is boot camp for tomorrow's insanity.","attribution":"Brad Frost"},
{"quote":"Nobody has any idea of what a new invention will really be good for. The crucial question is, what happens when everyone has one?","attribution":"Kevin Kelly"},
{"quote":"This is not a smart phone. This is a device to amplify curiosity.","attribution":"John Seely Brown"},
{"quote":"The most profound technologies are those that disappear. They weave themselves into the fabric of everyday life until they are indistinguishable from it.","attribution":"Mark Weiser"},
{"quote":"Statistics is the new grammar.","attribution":"Clive Thompson"},
{"quote":"Everything has changed, except our way of thinking.","attribution":"Albert Einstein"},
{"quote":"The true sign of intelligence is not knowledge but imagination.","attribution":"Albert Einstein"},
{"quote":"In the absence of consistent communications, they're going to tell themselves a story that confirms their worst fear.","attribution":"Michael Lopp (Rands In Repose)"},
{"quote":"We all know that art is not the truth, art is a lie that makes us realize the truth.","attribution":"Picasso"},
{"quote":"A crust eaten in peace is better than a feast eaten in fear.","attribution":"Aesop"},
{"quote":"Tell me a fact, and I'll learn. Tell me a truth and I'll believe. But tell me a story and it will live in my heart forever.","attribution":"Steve Sabol"},
{"quote":"I trust that my labor is holy. Out of this trust I live.","attribution":"Hermann Hesse"},
{"quote":"You need to spend time with the individual units of content in order to truly understand and craft a system.","attribution":"Erin Kissane"},
{"quote":"The thing I hate most about advertising is that it attracts all the bright, creative and ambitious young people, leaving us mainly with the slow and self-obsessed to become our artists. Modern art is a disaster area. Never in the field of human history has so much been used by so many to say so little.","attribution":"Banksy"},
{"quote":"Never make an enemy by accident.","attribution":"Anna Bates, Downton Abbey (Episode 3.1)"},
{"quote":"Worry is interest paid on trouble before it comes due.","attribution":"William Ralph Inge"},
{"quote":"Give a man a program and frustrate him for a day. Teach a man to program and you frustrate him for a lifetime.","attribution":"Hilary Mason"},
{"quote":"I've made the biggest breakthroughs when I'm completely unqualified for the job.","attribution":"Paula Scher"},
{"quote":"The big ideas in business are often very obvious, but it's very hard to maintain a firm grasp of the obvious at all times.","attribution":"Jeff Bezos"},
{"quote":"The world is in need of civilized mischief. Art is at the forefront of that need.","attribution":"Harry Belafonte"},
{"quote":"Creativity is as much about doing as having a blinding flash of inspiration.","attribution":"Nolan K Bushnell"},
{"quote":"Untidy desks are creativity's compost heaps.","attribution":"Willaim Gibson"},
{"quote":"Everything that irritates us about others can lead us to an understanding of ourselves.","attribution":"Carl Jung"},
{"quote":"It is probably a virus' is the doctor equivalent of 'works on my machine'.","attribution":"Nicholas C. Zakas"},
{"quote":"I write to discover what I think. After all, the bars aren't open that early.","attribution":"Daniel J. Boorstin"},
{"quote":"The best way to be future friendly is to be backward compatible.","attribution":"Jeremy Keith"},
{"quote":"Be regular and orderly in your life, so that you may be violent and original in your work.","attribution":"Gustave Flaubert"},
{"quote":"Information communicated as facts loses all its contexts and relationships, while information communicated as art or as experience maintains and nourishes its connections.","attribution":"Tom Bender"},
{"quote":"If you're not doing some things that are crazy, then you're doing the wrong things.","attribution":"Larry Page"},
{"quote":"Life begins at the end of your comfort zone.","attribution":"Neale Donald"},
{"quote":"Good leaders weaponize common sense.","attribution":"Michael Lopp (Rands In Repose)"},
{"quote":"If I'm building a team, I'll take generalists who are addicted to learning over specialists who are addicted to thinking that they already know.","attribution":"Kyle Wild"},
{"quote":"Prediction is very difficult, especially about the future.","attribution":"Niels Bohr"},
{"quote":"We accepted the products of science but rejected its methods.","attribution":"Carl Sagan"},
{"quote":"Celebrity should not be the worship of one by many from afar.","attribution":"Amanda Palmer"},
{"quote":"Writing and rewriting are the constant search for what one is saying.","attribution":"John Updike"},
{"quote":"I saw the best minds of my generation destroyed by madness, starving hysterical naked, pitching for funding.","attribution":"John Allsopp"},
{"quote":"If you control the code, you control the world.","attribution":"Marc Goodman"},
{"quote":"Those who cannot perceive the network cannot act effectively within it, and are powerless. The job, then is to make such things visible.","attribution":"James Bridle"},
{"quote":"In God we trust, all others bring data.","attribution":"W. Edwards Deming"},
{"quote":"I may not have gone where I intended to go, but I think I have ended up where I needed to be.","attribution":"Douglas Adams"},
{"quote":"I see god in the instruments and mechanisms that work reliably.","attribution":"Buckminster Fuller"},
{"quote":"I view a manual as a software designer's list of failures.","attribution":"Paul Heckel"},
{"quote":"The world is much more interesting than any one discipline.","attribution":"Edward Tufte"},
{"quote":"Ninety percent of everything is crap.","attribution":"Sturgeon's Law"},
{"quote":"The start is what stops most people.","attribution":"Don Shula"},
{"quote":"Somewhere, something incredible is waiting to be known.","attribution":"Carl Sagan"},
{"quote":"The city's central computer told you? R2D2, you know better than to trust a strange computer!","attribution":"C3PO"},
{"quote":"A prototype is an empathy machine. Its output is insight.","attribution":"Jennifer Brook"},
{"quote":"Hell, there are no rules here - we're trying to accomplish something.","attribution":"Thomas A. Edison"},
{"quote":"If you don't like how things are, change it! You're not a tree.","attribution":"Jim Rohn"},
{"quote":"If you can not measure it, you can not improve it.","attribution":"Lord Kelvin"},
{"quote":"Opportunity is missed by people because it is dressed in overalls and looks like work.","attribution":"Thomas Edison"},
{"quote":"If you can't get rid of the skeleton in your closet, you'd best teach it to dance.","attribution":"George Bernard Shaw"},
{"quote":"Q: How many software developers does it take to change a lightbulb? A: None it's a hardware problem.","attribution":"Ed Leafe"},
{"quote":"Success is the sum of small efforts, repeated day in and day out.","attribution":"R. Collier"},
{"quote":"The secret to getting ahead is getting started.","attribution":"Mark Twain"},
{"quote":"The trouble with the world is that the stupid are cocksure and the intelligent are full of doubt.","attribution":"Bertrand Russell"},
{"quote":"The life which is unexamined is not worth living.","attribution":"Socrates"},
{"quote":"The computer industry is the only industry that is more fashion-driven than women's fashion.","attribution":"Richard Stallman"},
{"quote":"Disappointment is the price of wanting a better world.","attribution":"Danny O'Brien"},
{"quote":"F* every cause that ends in murder and children crying.","attribution":"Iain Banks"},
{"quote":"In an attention economy advertising is theft.","attribution":"Nadav Savio"},
{"quote":"To all saying 'they're just words': words are literally what separates us and animals. To downplay their importance is avocado penguins.","attribution":"Kumail Nanjiani"},
{"quote":"I'm Bored, Let's Pivot","attribution":"Anonymous"},
{"quote":"A vision without execution is a hallucination.","attribution":"Thomas Edison"},
{"quote":"The fastest algorithm can frequently be replaced by one that is almost as fast and much easier to understand.","attribution":"Douglas W. Jones"},
{"quote":"The best way to predict your future is to create it.","attribution":"Abraham Lincoln"},
{"quote":"Burnout is not caused by working hard. Burnout is caused by not shipping.","attribution":"Mike Lee"},
{"quote":"The best time to plant an oak tree was 20 years ago. The second best time is today.","attribution":"Chinese Proverb"},
{"quote":"You are the average of the five people you spend the most time with.","attribution":"Jim Rohn"},
{"quote":"I'm a man of many epithets. There's my stage name, my pen name, my avatar. Had a pseudonym once, but had to leave Ushane.","attribution":"Rango as written by John Logan, Rango"},
{"quote":"Trying times are not the times to stop trying.","attribution":"Ray Owen"},
{"quote":"The question of whether a computer can think is no more interesting than the question of whether a submarine can swim.","attribution":"Edsger W. Dijkstra"},
{"quote":"Life is a process which may be abstracted from other media.","attribution":"John Von Neumann"},
{"quote":"It's better to know some of the questions than all of the answers.","attribution":"James Thurber"},
{"quote":"Do what you can, with what you have, where you are.","attribution":"Theodore Roosevelt"},
{"quote":"Without deviation from the norm, progress is not possible.","attribution":"Frank Zappa"},
{"quote":"It's amazing how many people either don't get or accept that programming isn't communicating with computers, it's communicating through them","attribution":"Sam Aaron"},
{"quote":"Open ecosystems accelerate learning, agility, and innovation but we don't make many.","attribution":"David Frigstad"},
{"quote":"Do not wait until all the conditions are perfect for you to begin. Beginning makes the conditions perfect.","attribution":"Alan Cohen"},
{"quote":"The finest eloquence is that which gets things done.","attribution":"Frmr UK Prime Min. David Lloyd George"},
{"quote":"Work begins when the fear of doing nothing at all finally trumps the terror of doing it badly.","attribution":"Alain de Botton"},
{"quote":"It takes courage to grow up and be who you really are.","attribution":"e.e. cummings"},
{"quote":"Toys and games are preludes to serious ideas.","attribution":"Charles Eames"},
{"quote":"No better sign of progress than when future feels mundane: it grants you the license to invent a new one.","attribution":"M. Buchanan"},
{"quote":"Code is easier to change than opinions.","attribution":"Colin Brumelle"},
{"quote":"Do not worry about your difficulties in Mathematics. I can assure you mine are still greater.","attribution":"Albert Einstein"},
{"quote":"Times are bad. Children no longer obey their parents and everyone is writing a book.","attribution":"Cicero, 106-43 BCE"},
{"quote":"He who asks a question may be a fool for five minutes, but he who never asks a question remains a fool forever.","attribution":"Tom J. Connelly"},
{"quote":"Writing code means always having to say you're sorry.","attribution":"Paul Ford"},
{"quote":"The illiterate of 21st century will not be those that cannot read &amp; write, but those who cannot learn, unlearn, and relearn.","attribution":"Alvin Toffler"},
{"quote":"Writing is thinking. To write well is to think clearly. That's why it's so hard.","attribution":"David McCullough"},
{"quote":"It is better to do the right problem the wrong way than the wrong problem the right way.","attribution":"Richard Hamming"},
{"quote":"When you know better you do better.","attribution":"Maya Angelou"},
{"quote":"Simplicity and elegance are unpopular because they require hard work and discipline to achieve and education to be appreciated.","attribution":"Edsger W. Dijkstra"},
{"quote":"Simple design, intense content.","attribution":"Edward Tufte"},
{"quote":"Too often we give children answers to remember rather than problems to solve.","attribution":"Roger Lewin"},
{"quote":"Want to be a web developer? Easy! First, imagine you're a carpenter. Second, imagine that the house you're building is made of live monkeys.","attribution":"David Yee"},
{"quote":"Toys and games are preludes to serious ideas.","attribution":"Charles Eames"},
{"quote":"Using the speed of technology as a weapon. Weaponized capitalism via technology. Welcome to the data plutocracy.","attribution":"Chris Dancy"},
{"quote":"Agility at scale : Dominance","attribution":"Robbie Jack"},
{"quote":"Civilization is a limitless multiplication of unnecessary necessities.","attribution":"Mark Twain"},
{"quote":"We always favor the urgent over the important.","attribution":"Benny Tomas"},
{"quote":"Learn from yesterday, live for today, hope for tomorrow. The important thing is not to stop questioning.","attribution":"Albert Einstein"},
{"quote":"Programs must be written for people to read, and only incidentally for machines to execute.","attribution":"Abelson & Sussman"},
{"quote":"Repetition is the death of magic.","attribution":"Bill Watterson"},
{"quote":"Simple design, intense content.","attribution":"Edward Tufte"},
{"quote":"If you want to go fast, go alone. If you want to go far, go together.","attribution":"African Proverb"},
{"quote":"Men do not differ much about what things they will call evils; they differ enormously about what evils they will call excusable.","attribution":"G. K. Chesterton"},
{"quote":"Fairy tales are more than true - not because they tell us dragons exist, but because they tell us dragons can be beaten.","attribution":"G. K. Chesterton"},
{"quote":"Your life is going to be full of people sounding like they know what they're talking about.","attribution":"Michael Lopp (Rands In Repose)"},
{"quote":"Education is the kindling of a flame, not the filling of a vessel.","attribution":"Socrates"},
{"quote":"If we all did the things we are capable of, we would astound ourselves.","attribution":"Thomas Edison"},
{"quote":"I fear the man who drinks water and so remembers this morning what the rest of us said last night.","attribution":"Benjamin Franklin"},
{"quote":"Isn't it funny how day by day nothing changes but, when we look back everything is different.","attribution":"C.S. Lewis"},
{"quote":"Money is circulated. Time is spent.","attribution":"Frank Chimero"},
{"quote":"There are only two hard things in Computer Science: cache invalidation and naming things.","attribution":"Phil Karlton"},
{"quote":"There are only two hard things in Computer Science: cache invalidation, naming things, and off-by-1-errors.","attribution":"Leon Bambrick"},
{"quote":"Humans are pattern seeking, storytelling animals. We weave narratives around those patterns to give them meaning.","attribution":"Michael Shermer"},
{"quote":"A mind troubled by doubt cannot focus on the course of victory.","attribution":"Arthur Golden"},
{"quote":"Happiness is not something you postpone for the future; it is something you design for the present.","attribution":"Jim Rohn"},
{"quote":"Habits are first cobwebs, then cables.","attribution":"Spanish Proverb"},
{"quote":"People rarely succeed unless they have fun in what they are doing.","attribution":"Dale Carnegie"},
{"quote":"You can't solve exponential problems with linear solutions.","attribution":"Banny Banerjee"},
{"quote":"If you want to build a ship, don't herd people together to collect wood and don't assign them tasks and work but rather teach them to long for the endless immensity of the sea.","attribution":"Antoine de Saint-Exupery"},
{"quote":"Beta? What's Beta? We had six weeks from inception to public launch. Any hiccups? Yes, but they're all features now.","attribution":"Sign from the Digg/Betaworks Party"},
{"quote":"Experience is not what happens to you; it's what you do with what happens to you.","attribution":"Aldous Huxley"},
{"quote":"Journalism is printing what somebody else doesn't want printed - everything else is public relations.","attribution":"George Orwell"},
{"quote":"It's a damn poor mind that can only think of one way to spell a word.","attribution":"Andrew Jackson"},
{"quote":"The court of public opinion is full of jesters.","attribution":"Max Quattromani"},
{"quote":"A programmer that knows one language will think it's perfect and defend it fanatically. One who knows more than one language hates them all.","attribution":"James Cash"},
{"quote":"I think there is a world market for maybe five computers.","attribution":"Thomas J. Watson"},
{"quote":"The best way to have a good idea is to have a lot of ideas.","attribution":"Linus Pauling"},
{"quote":"It seems there's an unlimited supply of outrage but a limited supply of action.","attribution":"Scott Hanselman"},
{"quote":"Failure is not falling down but refusing to get up.","attribution":"Chinese Proverb"},
{"quote":"You're only limited by your own imagination! And money. And talent. And genetics. And time. And other people. Go for it!","attribution":"Georg Grey"},
{"quote":"History is that certainty produced at the point where the imperfections of memory meet the inadequacies of documentation.","attribution":"Julian Barnes"},
{"quote":"The greatest real thrill that life offers is to create, to construct, to develop something useful.","attribution":"Alfred Sloan"},
{"quote":"It's important to remember that resilience and grit can be more significant than brilliance.","attribution":"John Gobron"},
{"quote":"Always do right - this will gratify some and astonish the rest.","attribution":"Mark Twain"},
{"quote":"If you hear a voice within you say 'you cannot paint', then by all means paint and that voice will be silenced.","attribution":"Vincent Van Gogh"},
{"quote":"A leader is best when people barely know he exists, when his work is done, his aim fulfilled, they will say: we did it ourselves.","attribution":"Lao Tzu"},
{"quote":"Skills can be taught. Character you either have or you don't have.","attribution":"Anthony Bourdain"},
{"quote":"Nobody can go back and start a new beginning, but anyone can start today and make a new ending.","attribution":"Maria Robinson"},
{"quote":"The master has failed more times than the beginner has even tried.","attribution":"Stephen McCranie"},
{"quote":"There are two rules for success: 1) Never tell everything you know.","attribution":"Roger H. Lincoln"},
{"quote":"Every child is an artist. The problem is how to remain an artist when we grow up.","attribution":"Pablo Picasso"},
{"quote":"Roaring dreams take place in a perfectly silent mind.","attribution":"Jack Kerouac"},
{"quote":"The past is not dead. In fact, it's not even past.","attribution":"William Faulkner"},
{"quote":"Isn't it astonishing that all these secrets have been preserved for so many years just so we could discover them!","attribution":"Orville Wright"},
{"quote":"Nothing can be understood without also understanding the environment.","attribution":"Russell L. Ackoff"},
{"quote":"But they [computers] are useless. They can only give you answers!","attribution":"Pablo Picasso"},
{"quote":"A teacher's responsibility is not to convey facts but to create enthusiasm for asking questions.","attribution":"Max Tegmark"},
{"quote":"Don't write code that guesses the future, arrange code so you can adapt to the future when it arrives.","attribution":"Sandi Metz"},
{"quote":"If you're an introspective, thoughtful person, interviews expecting you to have brilliant answers in real-time are the absolute worst.","attribution":"Matt Haughey"},
{"quote":"Easy reading is damn hard writing.","attribution":"Nathaniel Hawthorne"},
{"quote":"Confidence doesn't come from knowing you're right - it comes from being okay with failing.","attribution":"Mike Monteiro"},
{"quote":"We do not believe any group of men adequate enough or wise enough to operate without scrutiny or without criticism. We know that the only way to avoid error is to detect it, that the only way to detect it is to be free to inquire. We know that in secrecy error undetected will flourish and subvert.","attribution":"J Robert Oppenheimer"},
{"quote":"I was one of the few people in the world who believed in these things without going around making a dull middle class philosophy out of it.","attribution":"Jack Kerouac"},
{"quote":"A cynic is a man who, when he smells flowers, looks around for a coffin.","attribution":"H. L. Mencken"},
{"quote":"Developers need autonomy, mastery, and purpose, not pizzas, hugs, and ping-pong tables.","attribution":"Eduards Sizovs"},
{"quote":"Offer them what they secretly want and they of course immediately become panic-stricken.","attribution":"Jack Kerouac"},
{"quote":"Journalism is printing what someone else does not want printed: everything else is public relations.","attribution":"George Orwell"},
{"quote":"You are the equal of the idol who has given you your inspiration.","attribution":"Jack Kerouac"},
{"quote":"You need to let the little things that would ordinarily bore you suddenly thrill you.","attribution":"Andy Warhol"},
{"quote":"So long and take it easy, because if you start taking things seriously, it is the end of you.","attribution":"Jack Kerouac"},
{"quote":"However beautiful the strategy, you should occasionally look at the results.","attribution":"Attributed to Winston Churchill"},
{"quote":"Artists are people driven by the tension between the desire to communicate and the desire to hide.","attribution":"D.W. Winnicott"},
{"quote":"Culture eventually becomes the single biggest resistance to innovation.","attribution":"Scott Berkun"},
{"quote":"Unlike the moral universe, the long arc of technology curves not towards justice, but boredom.","attribution":"Tom Coates"},
{"quote":"Myth: you will create resolved work on the 1st try. Reality: I toss out 90% of what I make. To edit is to create.","attribution":"Elle Luna"},
{"quote":"Good programmers know what to write. Great ones know what to rewrite (and reuse).","attribution":"Eric Raymond"},
{"quote":"Never was anything great achieved without danger.","attribution":"Machiavelli"},
{"quote":"Getting up in the morning and DOING stuff puts you ahead of 99% of your competition.","attribution":"Scott Hanselman"},
{"quote":"How quickly revolutions grow old; and, worse still, respectable.","attribution":"G. K. Chesterton"},
{"quote":"Computers aren't the thing. They're the thing that gets us to the thing.","attribution":"Halt and Catch Fire, S04E09"},
{"quote":"The walls between art and engineering exist only in our minds.","attribution":"Theo Jansen"},
{"quote":"The sign of a developed country is not that the poor have basic services but that the rich use them too. Water, phones, power, transit.","attribution":"Benedict Evans"},
{"quote":"Much of computing has been woven on the loom of sorrow, and the tapestry will continue to unfold.","attribution":"Grady Booch"},
{"quote":"After three days without reading, talk becomes flavorless.","attribution":"Chinese Proverb"},
{"quote":"I saw that my life was a vast glowing empty page and I could do anything I wanted.","attribution":"Jack Kerouac"},
{"quote":"Don't tell them too much about your soul. They're waiting for just that.","attribution":"Jack Kerouac"},
{"quote":"The opposite of play isn't work. It's depression.","attribution":"Brian Sutton-Smith"},
{"quote":"To every man is given the key to the gates of heaven; the same key opens the gates of hell.","attribution":"Buddist Proverb"},
{"quote":"The first line you lay down in a drawing doesn't necessarily need to be there when it's finished.","attribution":"James Jirat Patradoon"},
{"quote":"The best self-improvement tool ever created was the mirror.","attribution":"John Miller"},
{"quote":"If you want to succeed, double your failure rate.","attribution":"Thomas J. Watson"},
{"quote":"Bad programmers worry about the code. Good programmers worry about data structures and their relationships.","attribution":"Linus Torvalds"},
{"quote":"Smart data structures and dumb code works a lot better than the other way around.","attribution":"Eric Raymond"},
{"quote":"The value of a well-designed object is that the people who use it can do things with it that the designer never imagined.","attribution":"Donald Norman"},
{"quote":"The very thing that makes you invisble to computers makes you glaringly obvious to other humans.","attribution":"Robinson Meyer"},
{"quote":"Too often we enjoy the comfort of opinion without the discomfort of thought.","attribution":"John F. Kennedy"},
{"quote":"If the human brain were so simple that we could understand it, we would be so simple that we couldn't.","attribution":"Emerson Pugh"},
{"quote":"Religion and art are saying the same things - stop, pay attention, be aware of the depth of time, see people, see others, be human.","attribution":"Buechner"},
{"quote":"Markets can stay irrational longer than you can stay solvent.","attribution":"John Maynard Keynes"},
{"quote":"The difference between fiction and reality? Fiction has to make sense.","attribution":"Tom Clancy"},
{"quote":"The point of quotations is that one can use another's words to be insulting.","attribution":"Amanda Cross"},
{"quote":"When forced to work within a strict framework the imagination is taxed to its utmost - and will produce its richest ideas. Given total freedom the work is likely to sprawl.","attribution":"T.S. Eliot"},
{"quote":"Don't aim to be civilized. Don't hope that straight people will keep you on as some kind of pet. To hell with them; they put you here. You should fully realize what society has made of you and take a terrible revenge.","attribution":"Bruce Sterling"},
{"quote":"Information is only secondary. It is the human contact that keeps the Net-addicted coming back.","attribution":"Raph Koster"},
{"quote":"Stop thinking about artwork as objects, and start thinking about them as triggers for experiences.","attribution":"Brian Eno"},
{"quote":"Wealth consists of not having great possessions, but in having few wants.","attribution":"Epictetus"},
{"quote":"Feedback thrives in orgs where the goal is not getting comfortable with hard conversations, but normalizing the discomfort.","attribution":"Brene Brown"},
{"quote":"It usually takes me more than three weeks to prepare a good impormptu speech.","attribution":"Mark Twain"},
{"quote":"Inspiration exists, but it has to find you working.","attribution":"Pablo Picasso"},
{"quote":"Ideas are like rabbits. You get a couple and learn how to handle them, and pretty soon you have a dozen.","attribution":"John Steinbeck"},
{"quote":"One thing I wish I knew when I started writing software a few decades back: It's not who is smarter, it's who can communicate better.","attribution":"Bryan Liles"},
{"quote":"Luck is the residue of design.","attribution":"John Milton"},
{"quote":"If you torture data long enough, it will confess to anything you like.","attribution":"R.H. Coase"},
{"quote":"The universe is made of stories, not atoms.","attribution":"Muriel Rukeyser"},
{"quote":"There is no way to amplify marginalized voices if structural inequality is reflected in our algorithms.","attribution":"Joanne McNeil"},
{"quote":"Entertain that we are living in an intellectual and spiritual dark age but there is too much technology to notice.","attribution":"Jessica Brookman"},
{"quote":"Interface evolves towards transparency.","attribution":"William Gibson"},
{"quote":"A doctor can bury his mistakes, but an architect can only advise his clients to plant vines.","attribution":"Frank Lloyd Wright"},
{"quote":"It is not the strongest of the species that survive, nor the most intelligent, but the one most responsive to change.","attribution":"Charles Darwin"},
{"quote":"Whenever you find yourself on the side of the majority, it is time to pause and reflect.","attribution":"Mark Twain"},
{"quote":"Tomorrow belongs to those who can hear it coming.","attribution":"David Bowie"},
{"quote":"Judge a man by his questions, not his answers.","attribution":"Voltaire"},
{"quote":"Pessimists desire the things they fear, to prove that they are right.","attribution":"Robert Mallet"},
{"quote":"No such thing as spare time, no such thing as free time, no such thing as down time. All you got is life time. Go","attribution":"Henry Rollins"},
{"quote":"Because in the end, you won't remember the time you spent working in the office or mowing your lawn. Climb that goddamn mountain.","attribution":"Jack Kerouac"},
{"quote":"If design is merely an inducement to consume, then we must reject design.","attribution":"Adolfo Natalini"},
{"quote":"If we let ourselves, we shall always be waiting for some distraction or other to end before we can really get down to our work.","attribution":"CS Lewis"},
{"quote":"People blame their problems on the people they don't like.","attribution":"Michael Lopp"},
{"quote":"Good specifications will always improve programmer productivity far better than any programming tool or technique.","attribution":"Milt Bryce"},
{"quote":"If it's a good idea, go ahead and do it. It is much easier to apologize than it is to get permission.","attribution":"Grace Hopper"},
{"quote":"We explore or we expire.","attribution":"Buzz Aldrin"},
{"quote":"Came down from my ivory tower and found no world.","attribution":"Jack Kerouac"},
{"quote":"If it's inaccessible to the poor, it's neither radical nor revolutionary.","attribution":"Unknown"},
{"quote":"We were on the roof of America and all we could do was yell.","attribution":"Jack Kerouac"},
{"quote":"... write only what kicks you and keeps you overtime awake from sheer mad joy.","attribution":"Jack Kerouac"},
{"quote":"In a time of universal deceit, telling the truth is a revolutionary act.","attribution":"George Orwell"},
{"quote":"No matter how it looks at first, it's always a peoplle problem.","attribution":"Gerald Weinberg"},
{"quote":"The poet is the person who uses words not primarily to convey information but to make a relationship, shape beauty, form truth.","attribution":"Eugene Peterson"},
{"quote":"The world is much more interesting than any one discipline.","attribution":"Edward Tufte"},
{"quote":"Sleepwalking into surveillance capitalism, which is evolving into data and computation driven authoritarianism, one cool service at a time.","attribution":"Zeynep Tufekci"},
{"quote":"Effective is not equal to productive. Effective teams can solve gnarly business problems with *little or no* code.","attribution":"Dan North"},
{"quote":"We have not come as far as we think we have. We pat ourselves on the back for small changes, but these aren't structural changes.","attribution":"Yaa Gyasi"},
{"quote":"You can't build a great organization unless you have an opinion on how an organization should operate.","attribution":"Kate Heddleston"},
{"quote":"Technology. Everyone's so afraid of missing what's next they never bother to fix/optimize what's here now.","attribution":"Luke Wroblewski"},
{"quote":"All software will fail, but good software fails well.","attribution":"Theo Schlossnagle"},
{"quote":"It's not about what it is, it's about what it can become.","attribution":"Dr. Seuss, The Lorax, 1971"},
{"quote":"A book must be the axe for the frozen sea inside us.","attribution":"Franz Kafka"},
{"quote":"We need systems that do not require personal heroics for people to do the right thing.","attribution":"Josh Kodroff"},
{"quote":"I ask you to judge me by the enemies I have made.","attribution":"Franklin D. Roosevelt"},
{"quote":"I think I did pretty well, considering I started with nothing but a bunch of blank paper.","attribution":"Steve Martin"},
{"quote":"The fundamental fight is not between left and right but between proudly-ignorant, reckless and incompetent indecency and those who oppose it.","attribution":"Benjamin Wittes"},
{"quote":"Many computer programmers are prima donnas who are temperamentally more akin to artists than to technicians.","attribution":"Thomas H. Crowley, 1967"},
{"quote":"Do I contradict myself? Very well then I contradict myself, (I am large, I contain multitudes.)","attribution":"Walt Whitman"},
{"quote":"On some nights I still believe that a car with the gas needle on empty can run about fifty more miles with the right music on the radio.","attribution":"Hunter S. Thompson"},
{"quote":"Serious writers write, inspired or not. Over time they discover that routine is a better friend than inspiration.","attribution":"Ralph Keyes"},
{"quote":"Telling a programmer there's already a library to do X is like telling a songwriter there's already a song about love.","attribution":"Pete Cordell"},
{"quote":"We are building skyscraper favelas in code - in earthquake zones.","attribution":"Zeynep Tufekci"},
{"quote":"An object in possession seldom retains the same charm that it had in pursuit.","attribution":"Pliny the Younger"},
{"quote":"A complex system that works is invariably found to have evolved from a simple system that worked. A complex system designed from scratch never works and cannot be patched up to make it work. You have to start over with a working simple system.","attribution":"John Gall"},
{"quote":"A developed country is not a place where the poor have cars. It's where the rich use public transportation.","attribution":"Enrique Penalosa"},
{"quote":"Nothing pleases people more than to go on thinking what they have always thought, and at the same time imagine that they are thinking something new and daring: it combines the advantage of security and the delight of adventure.","attribution":"TS Eliot"},
{"quote":"Good writers rewrite. Good programmers refactor. Good designers revise. The first idea is seldom the best. The first iteration is seldom the best.","attribution":"Stephen Hay"},
{"quote":"I think it's terribly dangerous for an artist to fulfill other people's expectations. They generally produce their worst work when they do that.","attribution":"David Bowie"},
{"quote":"Things are so hard to figure out when you live from day to day in this feverish and silly world.","attribution":"Jack Kerouac"},
{"quote":"I believe deep thinking can only be done in writing. To follow an idea seriously, you must constantly pause to consider all possibilities, which takes time and care.","attribution":"François Chollet"},
{"quote":"If you want truth to go round the world you must hire an express train to pull it; but if you want a lie to go round the world, it will fly; it is light as a feather and a breath will carry it.","attribution":"Rev. Charles Haddon Spurgeon"},
{"quote":"All models are wrong, but some are useful.","attribution":"George Box"},
{"quote":"An intellectual says a simple thing in a hard way. An artist says a hard thing in a simple way.","attribution":"Charles Bukowski"},
{"quote":"The absence of limitations is the enemy of art.","attribution":"Orson Welles"},
{"quote":"We are what we pretend to be, so we must be careful who we pretend to be.","attribution":"Kurt Vonnegut"},
{"quote":"Arrangements of technical architecture are arrangements of power.","attribution":"Dr. Laura DeNardis"},
{"quote":"Let me fall if I must fall. The one I will become will catch me.","attribution":"The Baal Shem Tov"},
{"quote":"There can be no expertise in innovation unless there is also expertise in demolishing the ensconced.","attribution":"Kevin Kelly"},
{"quote":"You are precisely as big as what you love and precisely as small as what you allow to annoy you.","attribution":"Robert Anton"},
{"quote":"Although data can make a compelling case for something, data rarely create the emotions needed to spur people into action.","attribution":"John Maeda"},
{"quote":"To harmonize the whole is the task of art.","attribution":"Wassily Kandinsky"},
{"quote":"Everyone likes to write reusable code, no-one likes to reuse someone else's code.","attribution":"Eryn O'Neil"},
{"quote":"I would say that shared understanding is what enables the network of different beliefs to exist. If we aim only for agreement, the network collapses into a single belief.","attribution":"Marcus Rådell"},
{"quote":"I want to work in revelations, not spin silly tales for money.","attribution":"Jack Kerouac"},
{"quote":"As long as I remain unafraid to admit that I don't know, as that is the first step to finding out.","attribution":"Rachel Andrew"},
{"quote":"Computers are just as oppressive as before, but smaller and cheaper and more widespread. Now you can be oppressed by computers in your living room.","attribution":"Ted Nelson"},
{"quote":"Sometimes it is better to light a flamethrower than curse the darkness.","attribution":"Terry Pratchett"},
{"quote":"There may be times when we are powerless to prevent injustice, but there must never be a time when we fail to protest.","attribution":"Elie Wiesel"},
{"quote":"What is it about becoming a professional that takes the poetry out of us?","attribution":"John Paul Lederach"},
{"quote":"It's hard to keep apocalypse consistently in mind, especially if you want to get out of bed in the morning.","attribution":"Zadie Smith"},
{"quote":"You are not entitled to your opinion. You are entitled to your informed opinion. No one is entitled to be ignorant.","attribution":"Harlan Ellison"},
{"quote":"If you want to build a ship, don't drum up the men to gather wood, divide the work, and give orders. Instead, teach them to yearn for the vast and endless sea.","attribution":"Antoine de Saint-Exup�ry"},
{"quote":"I am, somehow, less interested in the weight and convolutions of Einstein's brain than in the near certainty that people of equal talent have lived and died in cotton fields and sweatshops.","attribution":"Stephen Jay Gould"},
{"quote":"The responsibility of leadership is not to come up with all the ideas but to create an environment in which great ideas thrive.","attribution":"Simon Sinek"},
{"quote":"There can be no expertise in innovation unless there is also expertise in demolishing the ensconced.","attribution":"Kevin Kelly"},
{"quote":"Although data can make a compelling case for something, data rarely create the emotions needed to spur people into action.","attribution":"John Maeda"},
{"quote":"[The] Computer field is accustomed to falsely imposing hierarchy, orderliness, and regularity on what is not ordered and regular... and I say we must stop doing that.","attribution":"Ted Nelson"},
{"quote":"Merit rating rewards people that do well in the system. It does not reward attempts to improve the system.","attribution":"Deming"},
{"quote":"You can use an eraser on the drafting table or a sledge hammer on the construction site.","attribution":"Frank Lloyd Wright"},
{"quote":"Amateurs have a goal. Professionals have a process.","attribution":"Shane Parrish"},
{"quote":"You cannot buy the revolution. You cannot make the revolution. You can only be the revolution. It is in your spirit, or it is nowhere.","attribution":"Ursula K. Le Guin, The Dispossessed"},
{"quote":"You can't understand a codebase without knowing the aspirations of the company at the time.","attribution":"Rachel Davies"},
{"quote":"Continuous improvement is better than delayed perfection.","attribution":"Mark Twain"},
{"quote":"So much complexity in software comes from trying to make one thing do two things.","attribution":"Ryan Singer"},
{"quote":"When a service 'predicts' what 'you' want, it is actually reshaping you into what makes it profitable.","attribution":"Rob Horning"},
{"quote":"When writing code, you're always collaborating with future-you; and past-you doesn't respond to emails.","attribution":"Hadley Wickham"},
{"quote":"Software is a liquid. It fills whatever hardware container into which it is poured.","attribution":"Grady Booch"},
{"quote":"You can use an eraser on the drafting table or a sledge hammer on the construction site.","attribution":"Frank Lloyd Wright"},
{"quote":"Every day, computers are making people easier to use.","attribution":"David Temkin"},
{"quote":"Authority without wisdom is like a heavy axe without an edge, fitter to bruise than polish.","attribution":"Anne Bradstreet"},
{"quote":"Amateurs have a goal. Professionals have a process.","attribution":"Shane Parrish"},
{"quote":"People are fairly good at short-term design, and usually awful at long-term design.","attribution":"Dr. Roy Fielding"},
{"quote":"There is nothing more permanent than a temporary hack.","attribution":"Kyle Simpson"},
{"quote":"The greatest occupational risk of being successful in tech is the idea that because you know how computers work that society owes you fealty and subservience.","attribution":"David Heinemeier Hansson"},
{"quote":"We build our computer systems the way we build our cities: over time, without a plan, on top of ruins.","attribution":"Ellen Ullman"},
{"quote":"There is nothing more unproductive than to build something efficiently that should not have been built at all.","attribution":"Milt Bryce"},
{"quote":"In programming, the hard part isn't solving problems, but deciding what problems to solve.","attribution":"Paul Graham"},
{"quote":"The hardest part of being a developer isn't the code, it's learning that the entire internet is put together with peanut butter and goblins.","attribution":"Sarah Drasner"},
{"quote":"Understand well as I may, my comprehension can only be an infinitesimal fraction of all I want to understand.","attribution":"Ada Lovelace"},
{"quote":"The trick is to fix the problem you have, rather than the problem you want.","attribution":"Bram Cohen"},
{"quote":"A ship in port is safe, but that is not what ships are for. Sail out to sea and do new things.","attribution":"Grace Hopper"},
{"quote":"Never trust a computer you can't throw out a window.","attribution":"Steve Wozniak"},
{"quote":"If you want something new, you have to stop doing something old.","attribution":"Peter F. Drucker"},
{"quote":"Weeks of coding can save you hours of planning.","attribution":"Unknown"},
{"quote":"Crunch is not a triumph of the workforce. It is a failure of the management.","attribution":"Jim Sterling"},
{"quote":"A primary cause of complexity is that software vendors uncritically adopt almost any feature that users want.","attribution":"Niklaus Wirth"},
{"quote":"The question is not if we will be extremists, but what kind of extremists we will be. The nation and the world are in dire need of creative extremists.","attribution":"Martin Luther King Jr"},
{"quote":"Somewhere, something incredible is waiting to be known.","attribution":"Carl Sagan"},
{"quote":"That so few now dare to be eccentric marks the chief danger of our time.","attribution":"John Stuart Mill"},
{"quote":"The cure for boredom is curiosity. There is no cure for curiosity.","attribution":"Dorothy Parker"},
{"quote":"When you can do a common thing in an uncommon way; you will command the attention of the world.","attribution":"George Washington Carver"},
{"quote":"The cheapest, fastest, and most reliable components are those that aren�t there.","attribution":"Gordon Bell"},
{"quote":"Process that is heavy is process that is eventually abandoned ... provided it doesn't kill you first.","attribution":"Sisyphus, 530bc"},
{"quote":"The ambiguous meaning of human experience is somewhat at odds with the capacities of computers; machines transform things into numbers, whereas humans transform numbers into meaning.","attribution":"Ian Bogost"},
{"quote":"Leaders who don't listen will eventually be surrounded by people who have nothing to say.","attribution":"Andy Stanley"},
{"quote":"The price of anything is the amount of life you exchange for it.","attribution":"Henry David Thoreau"},
{"quote":"Managers will try anything easy that doesn't work before they will try anything hard that does work.","attribution":"Jim Womack"},
{"quote":"If everyone is thinking alike, then someone isn't thinking.","attribution":"George S. Patton"},
{"quote":"We die. That may be the meaning of life. But we do language. That may be the measure of our lives.","attribution":"Toni Morrison"},
{"quote":"If you are not willing to learn, no one can help you. If you are determined to learn, no one can stop you","attribution":"Buddist Proverb"},
{"quote":"We're all stories, in the end. Just make it a good one, eh?","attribution":"Doctor Who, s05e13, The Big Bang"},
{"quote":"What we call a disaster is tied up in what we find dramatic.","attribution":"Charlie Loyd"},
{"quote":"If you think this Universe is bad, you should see some of the others.","attribution":"Philip K. Dick"},
{"quote":"There's a big difference between making a simple product and making a product simple.","attribution":"Des Traynor"},
{"quote":"Anyone who says distributed systems are easy does not have sufficient experience with distributed systems.","attribution":"Martin Thompson"},
{"quote":"I don't care that they stole my idea - I care that they don't have any of their own.","attribution":"Nikola Tesla"},
{"quote":"Two aesthetics exist: the passive aesthetic of mirrors and the active aesthetic of prisms.","attribution":"Jorge Luis Borges"},
{"quote":"Simplicity is a great virtue but it requires hard work to achieve it and education to appreciate it. And to make matters worse: complexity sells better.","attribution":"Edsger W. Dijkstra"},
{"quote":"If you get, give. If you learn, teach.","attribution":"Maya Angelou"},
{"quote":"The art of progress is to preserve order amid change and to preserve change amid order.","attribution":"Alfred North Whitehead"},
{"quote":"The walls between art and engineering exist only in our minds.","attribution":"Theo Jansen"},
{"quote":"You're only given one little spark of madness. You mustn't lose it.","attribution":"Robin Williams"},
{"quote":"People do not seem to realize that their opinion of the world is also a confession of their character.","attribution":"Ralph Waldo Emerson"},
{"quote":"I am not what happened to me. I am what I choose to become.","attribution":"Carl Jung"},
{"quote":"In the future, everyone will want to be anonymous for fifteen minutes.","attribution":"Anonymous"},
{"quote":"Progress feels good. But progress feels even better when you put it to the test and learn something.","attribution":"John Cutler"},
{"quote":"Growing old is mandatory. Growing up is optional.","attribution":"Chili Davis"},
{"quote":"There are far better things ahead than any we leave behind.","attribution":"CS Lewis"},
{"quote":"We don't need more humanities majors in tech, we need fewer sociopaths elevated to leadership.","attribution":"Kellen Elliot-McCrea"},
{"quote":"Hard times are coming, when we�ll be wanting the voices of writers who can see alternatives to how we live now, can see through our fear-stricken society and its obsessive technologies to other ways of being, and even imagine real grounds for hope.","attribution":"Ursula Le Guin"},
{"quote":"Leaders who don't listen will eventually be surrounded by people who have nothing to say.","attribution":"Andy Stanley"},
{"quote":"Programs must be written for people to read, and only incidentally for machines to execute.","attribution":"Harold Abelson"},
{"quote":"While 'losing control' is one of the biggest fears in management, 'having control' is one of the biggest illusions.","attribution":"Bjarte Bogsnes"},
{"quote":"Each epoch dreams the one to follow.","attribution":"Jules Michelet"},
{"quote":"'If it weren't for the people, the god-damn people' said Finnerty, 'always getting tangled up in the machinery. If it weren�t for them, the world would be an engineer's paradise.'","attribution":"Kurt Vonnegut (Player Piano,1952)"},
{"quote":"Programming is not a zero-sum game. Teaching something to a fellow programmer doesn�t take it away from you.'","attribution":"John Carmack"},
{"quote":"Whenever you write, whatever you write, never make the mistake of assuming the audience is any less intelligent than you are.'","attribution":"Rod Serling"},
{"quote":"What one programmer can do in one month, two programmers can do in two months.","attribution":"Fred Brooks"},
{"quote":"Architecture represents the significant decisions, where significance is measured by the cost of change.","attribution":"Grady Booch"},
{"quote":"Meetings are indispensable when you don't want to do anything.","attribution":"John Kenneth Galbraith"},
{"quote":"I must create a system, or be enslaved by another man's.","attribution":"William Blake"},
{"quote":"Style is knowing who you are, what you want to say, and not giving a damn.","attribution":"Gore Vidal"},
{"quote":"Style is not something applied. It is something that permeates. Is is of the nature of that in which it is found, whether the poem, the manner of a god, the bearing of a man. It is not a dress.","attribution":"Wallace Stevens"},
{"quote":"There's no such thing as a permanent state of turmoil. Eventually, turmoil becomes normal.","attribution":"Cory Doctorow"},
{"quote":"The new beautiful freaks will teach us all how to play again (and they'll suffer society's penalty).","attribution":"Richard Neville"},
{"quote":"Life's too short to play the game.  If you can't exist outside of the system, then you can't make your own choices, you can't follow your own muse.","attribution":"Bob Lefsetz"},
{"quote":"Being well-enough known to be pirated [is] a crowning achievement.","attribution":"Tim O'Reilly"},
{"quote":"Rembmer that people break down, too, not just machinery.","attribution":"Gregory Benford"},
{"quote":"Software is done the way that the dishes are done. You can only consider it finished if you never plan on using it again.","attribution":"Dave Cheney"},
{"quote":"When you invent the ship, you also invent the shipwreck. Every technology carries its own negativity, which is invented at the same time as technical progress.","attribution":"Paul Virilio"},
{"quote":"I'm becoming convinced that we know far less than we think and we think much less than we know.","attribution":"Walter Kirn"},
{"quote":"The premature codification of complex issues into neat and tidy solutions is a large consultancy disease and a fertile field for snake oil sales people and charlitans.","attribution":"Dave Snowden"},
{"quote":"We are called to be architects of the future, not its victims.","attribution":"Buckminster Fuller"},
{"quote":"Unrealistic beliefs on scope - often hidden and undiscussed - kill high standards. To achieve high standards yourself or as part of a team, you need to form and proactively communicate realistic beliefs about how hard something is going to be.","attribution":"Jeff Bezos"},
{"quote":"Merit rating rewards people that do well in the system. It does not reward attempts to improve the system.","attribution":"W. Edwards Deming"},
{"quote":"Storing information means increasing the complexity of the mechanism.","attribution":"Ramon Margalef"},
{"quote":"We aren't trying to ship software as fast as possible, we are trying to add value as fast as possible.","attribution":"Donovan Brown"},
{"quote":"Lord, grant me the skill to recognize and critique bad design, the humility to not criticize opinionated design that differs from my opinions, and the wisdom to know the difference.","attribution":"Larry Garfield"},
{"quote":"The key to writing less code and causing less rework is to write better abstractions. Get better at identifying and avoiding repetative code.","attribution":"Eric Elliott"},
{"quote":"Being a professional is the willingness to put oneself in the position of a novice, over and over, so we can continue to learn, improve, and apply.","attribution":"Venkat Subramaniam"},
{"quote":"Building the wrong thing is the biggest waste in software development.","attribution":"Mary Poppendieck"},
{"quote":"Reliable systems don't have to be perfect - they have to have sensible tradeoffs.","attribution":"Mary Poppendieck"},
{"quote":"Code is not self-documenting. Anyone who tells you otherwise is lying as they mint technical debt.","attribution":"Jessy Irwin"},
{"quote":"When on teaches, two learn.","attribution":"Robert Heinlein"},
{"quote":"Any sufficiently advanced incompetence is indistinguishable from malice.","attribution":"Lana Nana"},
{"quote":"Uncertainty is an uncomfortable position, but certainty is an absurd one.","attribution":"Voltaire"},
{"quote":"Quality is doing it right when no one is watching.","attribution":"Henry Ford"},
{"quote":"When one teaches, two learn.","attribution":"Robert Heinlein"},
{"quote":"World War III is a guerrilla information war with no division between military and civilian participation.","attribution":"Marshall McLuhan"},
{"quote":"I conceive that the great part of the miseries of mankind are brought upon them by false estimates they have made of the value of things.","attribution":"Benjamin Franklin"},
{"quote":"I came to see, in my time at IBM, that culture isn't just one aspect of the game - it is the game.","attribution":"Louis V. Gerstner Jr."},
{"quote":"If you watch trillions of things, you will often see one-in-a-million coincidences.","attribution":"Vernor Vinge"},
{"quote":"No system can survive that doesn't serve a useful purpose.","attribution":"Harry Hillaker"},
{"quote":"The person who loves their dream of community will destroy community (even if their intentions are ever so earnest), but the person who loves those around them will create community.","attribution":"D. Bonhoeffer"},
{"quote":"People with targets and jobs dependent on meeting them will probably meet the targets - even if they have to destroy the enterprise to do it.","attribution":"W. Edwards Deming"},
{"quote":"If you don't know where you are going, any road will get you there.","attribution":"Lewis Carroll"},
{"quote":"The danger of computers becoming like humans is not as great as the danger of humans becoming like computers.","attribution":"Konrad Zuse"},
{"quote":"There is no reason anyone would want a computer in their home.","attribution":"Ken Olsen (1977)"},
{"quote":"From cells to cities, from satellites to web sites, at a certain level of abstraction every system manifests a message passing architecture.","attribution":"Grady Booch"},
{"quote":"I think our drug of choice these days is knowing who we're better than.","attribution":"anonymous"},
{"quote":"Imagination is the only weapon in the war against reality.","attribution":"Lewis Carroll"},
{"quote":"It is shameful and sad how many root causes fester while people build processes to make the symptoms tolerable.","attribution":"Tim Ottinger"},
{"quote":"Every manager supposes that they are doing their best. They are, and this is the problem.","attribution":"W. Edwards Deming"},
{"quote":"Talent is insignifigant. I know a lot of talented ruins. Beyond talent lie all the usual words: discipline, love, luck, but most of all, endurance.","attribution":"James Baldwin"},
{"quote":"The question that drives evangelism for me is: are people aware? The question that drives advocacy is: are people successful?","attribution":"Josh Dzielak"},
{"quote":"Rarely is anyone thanked for the work they did to prevent the disaster that didn't happen.","attribution":"Mikko Hypponen"},
{"quote":"Why would you ever spend a few minutes reading the documentation when you can spend a few hours randomly trying things? ","attribution":"Ali spittel"},
{"quote":"Simple, clear purpose and principles give rise to complex and intelligent behavior. Complex rules and regulations give rise to simple and stupid behavior.","attribution":"Dee Hock"},
{"quote":"-just remember that your real job is that if you are free, you need to free somebody else. If you have some power, then your job is to empower somebody else.","attribution":"Toni Morrison"},
{"quote":"When you're finished changing, you're finished.","attribution":"Fortune Cookie Fortune, Lucky Numbers 49, 31, 14, 46, 8, 34"},
{"quote":"It is not the domain experts knowledge that goes to production, it is the assumption of the developers.","attribution":"Alberto Brandolini"},
{"quote":"There is only one corner of the universe we can be certain of improving, and that's our own selves.","attribution":"Aldous Huxley"},
{"quote":"Life isn't a support system for art. It's the other way around.","attribution":"Stephen King"},
{"quote":"First let chaos reign, then reign in chaos.","attribution":"Andy Grove"},
{"quote":"The secret to building great products is not creating awesome features, it's to make your users awesome.","attribution":"Kathy Sierra"},
{"quote":"Before you distrub the system in any way, watch how it behaves.","attribution":"Donella Meadows"},
{"quote":"Being a genius doesn't excuse being an asshole.","attribution":"Cindy Cohn"},
{"quote":"The code you write is future tech debt. The problem you help solve are business value.","attribution":"Silvia Botros"},
{"quote":"Forcing people to have an answer to every problem they report is an obstacle that makes it harder for them to report problems.","attribution":"L. David Marquet"},
{"quote":"What is the robbing of a bank compared to the founding of a bank?","attribution":"Bertolt Brecht"},
{"quote":"'Reality' is the temporary resultant of continuous struggles between rival gangs of programmers. And every moment is a new and shocking Transvaluation of all we have ever been.","attribution":"T.S. Eliot"},
{"quote":"Once men turned their thinking over to machines in the hope that this would set them free. But that only permitted other men with machines to enslave them.","attribution":"Frank Herbert"},
{"quote":"Nothing can be changed until it is faced.","attribution":"James Baldwin"},
{"quote":"As the births of living creatures are at first ill-shapen, so are all innovations, which are the births of time.","attribution":"Francis Bacon"},
{"quote":"Beware the investment activity that produces applause. The great moves are usually greated by yawns.","attribution":"Warren Buffett"},
{"quote":"Don't underestimate the compounding awesomeness of continually fixing small broken things.","attribution":"Michael Lopp"},
{"quote":"When people are holding on tightly to the past, it's because there is something they value and they have no idea of what might be valuable in the future.","attribution":"Esther Derby"},
{"quote":"If a machine is expected to be infallible, it cannot also be intelligent.","attribution":"Alan Turing"},
{"quote":"Much that passes as idealism is disguised hatred or disguised love of power.","attribution":"Bertrand Russell"},
{"quote":"People won't self-organize around systems they don't understand. People won't make experiments if they're afraid of breaking invisible things.","attribution":"Alberto Brandolini"},
{"quote":"Never trust anything that can think for itself if you can't see where it keeps its brain.","attribution":"J.K. Rowling, Harry Potter and the Chamber of Secrets"},
{"quote":"There is nothing new under the sun, but there are new suns.","attribution":"Octavia E. Butler"},
{"quote":"Either write things worth reading, or do things worth the writing.","attribution":"Benjamin Franklin"},
{"quote":"Everything is narrative. The stories we tell our kids is the world those kids create.","attribution":"Clarence Young"},
{"quote":"Growth for the sake of growth is the ideology of the cancer cell.","attribution":"Edward Abbey"},
{"quote":"If our 'message' is anything, it's a positive approach to life. That life is basically good. People are basically good.","attribution":"Jim Henson"},
{"quote":"The problem with being clever and original in software design is that it gets to be a habit - you start reflexively making things cute and complicated when you should be keeping them robust and simple.","attribution":"Eric Raymond"},
{"quote":"[In a changing world] the ability to learn faster than competitors may be the only sustainable competitive advantage.","attribution":"Arie de Geus"},
{"quote":"Don’t think about making art, just get it done. Let everyone else decide if it’s good or bad, whether they love it or hate it. While they are deciding, make even more art.","attribution":"Andy Warhol"},
{"quote":"The art of programming is the art of organizing complexity; mastering multitude & avoiding its chaos as effectively as possible.","attribution":"Edsger W. Dijkstra"},
{"quote":"If you want to learn to do a thing both well and fast, then do it well and slow for approximately forever.","attribution":"Jessica Joy Kerr"},
{"quote":"Code is for humans. If it was exclusively for computers, we’d have no need for a high-level language like Javascript or Python.","attribution":"Devon Campbell"},
{"quote":"Management's job is to improve the system. Management's job is to know which systems are stable and which are not. Management's job is to look ahead. Management's job is to optimize the whole system.","attribution":"W. Edward Deming"},
{"quote":"Humans have better things to do than pretend to be machines.","attribution":"Amber Case"},
{"quote":"Don't ask what the world needs. Ask what makes you come alive and go do it. Because what the world needs is more people who have come alive.","attribution":"Howard Thurman"},
{"quote":"Always implement things when you actually need them, never when you just foresee that you need them.","attribution":"Ron Jeffries"},
{"quote":"I define a leader as anyone who takes responsibility for finding the potential in people and processes, and who has the courage to develop that potential.","attribution":"Brené Brown"},
{"quote":"It may look like a crisis, but it's only the end of an illusion.","attribution":"Jerry Weinberg"},
{"quote":"If you want to transform your culture, start with yourself as a leader.","attribution":"Jim Whitehurst"},
{"quote":"Coordination and communication swamp all other costs in modern software development.","attribution":"Kellan Elliott-McCrea"},
{"quote":"The absence of limitations is the enemy of art.","attribution":"Orson Welles"},
{"quote":"To do a dull thing with style-now that's what I call art.","attribution":"Charles Bukowski"},
{"quote":"Programmers have to fight against the two most destructive forces in the universe: entropy and stupidity.","attribution":"Damian Conway"},
{"quote":"It is not the domain experts knowledge that goes to production, it is the assumption of the developers.","attribution":"Alberto Brandolini"},
{"quote":"A program is not only code written to be executed by a machine; primarily it is a letter, written in a formal language by a programmer, where he explains to another programmer which problem he had and how he solved it.","attribution":"Mario Fusco"},
{"quote":"You haven't mastered a tool until you understand when it should not be used.","attribution":"Kelsey Hightower"},
{"quote":"Rarely do we find men who willingly engage in hard, solid thinking. There is an almost universal quest for easy answers and half-baked solutions.","attribution":"Martin Luther King Jr."},
{"quote":"Collaboration without a common language is just noise before failure.","attribution":"Simon Wardley"},
{"quote":"One of the biggest fallacies in tech is that you can solve culture problems by writing the perfect piece of code.","attribution":"Caitie McCaffrey"},
{"quote":"Most people want to improve, but few want to hear from an outsider - or from anyone else for that matter - that they are wrong.","attribution":"Esther Derby"},
{"quote":"There are things that can be measured. There are things that are worth measuring. But what can be measured is not always what is worth measuring; what gets measured may have no realtionship to what we really want to know.","attribution":"Jerry Z. Muller"},
{"quote":"Human intelligence is dynamic, multi sensory, complex, uncertain, and interactive. AI today is still simple, static, and disembodied.","attribution":"Dr. Fei-Fei Li"},
{"quote":"Every line of code has an ethical dimension. Deciding to not write code for ethical reasons falls within this definition.","attribution":"Grady Booch"},
{"quote":"The myth of management is that it exists. The myth of communications is that it occurred. The myth of software is that it's ever done.","attribution":"Andy Hunt"},
{"quote":"If we could fix trust, we could fix the system architecture.","attribution":"anonymous"},
{"quote":"The essense of systems is relationships, interfaces, form, fit and function.","attribution":"Eberhardt Rechtin"},
{"quote":"We've all been raised on television to believe that one day we'd all be millionaires, and movie gods, and rock stars. But we won't. And we're slowly learning that fact. And we're very, very pissed off.","attribution":"Chuck Palahniuk"},
{"quote":"A good manager does their best to empower their people within the system. A great manager does their best to dismantle any system that takes people's power away in the first place.","attribution":"Doc Norton"},
{"quote":"Advocating for quality is like advocating for virtue, or for fairness; it's empty advocacy until we agree on what we mean.","attribution":"Michael Bolton"},
{"quote":"Absorb what is useful; discard what is not; add what is uniquely your own.","attribution":"Bruce Lee"},
{"quote":"Anything invented after you're thirty-five is against the natural order of things.","attribution":"Douglas Adams"},
{"quote":"You think your pain and your heartbreak are unprecedented in the history of the world, but then you read.","attribution":"James Baldwin"},
{"quote":"If you care about productivity, you care about internal code quality. If you want to go faster tomorrow, you care about the quality of the code you wrote today.","attribution":"GeePaw Hill"},
{"quote":"Investments in technology are also investments in people, and these investments will make our technology process more sustainable.","attribution":"Nicole Forsgren"},
{"quote":"The human soul doesn't want to be advised or fixed or saved. It simply wants to be witnessed - to be seen, heard, and companioned exactly as it is.","attribution":"Parker J. Palmer"},
{"quote":"Computer science is no more about computers than astronomy is about telescopes.","attribution":"Edsger Djikstra"},
{"quote":"Good management is more about gardening than firefighting.","attribution":"Marco Rodgers"},
{"quote":"One man practicing kindness in the wilderness is worth all the temples this world pulls.","attribution":"Jack Kerouac"},
{"quote":"Cooperation requires conflict but not coersion.","attribution":"Kristof Van Tomme"},
{"quote":"You begin saving the world by saving one man at a time; all else is grandiose romanticism or politics.","attribution":"Charles Bukowski"},
{"quote":"Writing is not fun, but having written is great.","attribution":"Glen Weldon"},
{"quote":"You can only convince people who think they can benefit from being convinced.","attribution":"Nassim Taleb"},
{"quote":"Autonomy has become compulsive, we need to remember we are still tribal creatures that require tribal safety.","attribution":"Danielle Braun"},
{"quote":"If we saw tomorrow's newspaper today, tomorrow would never happen.","attribution":"Kenneth Boulding"},
{"quote":"Everything has been said before, but since nobody listens we have to keep going back and beginning all over again.","attribution":"André Gide"}
] }